doc/export.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-04-09 Sun 09:48 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orgmode publish</title>
<meta name="author" content="Jakub Šťastný" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../assets/styles.css"/>
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Orgmode publish</h1>

<div id="outline-container-org1a5b518" class="outline-5">
<h5 id="org1a5b518"><span class="section-number-5">0.0.0.1.</span> <span class="todo TODO">TODO</span> Chapter under construction</h5>
<div class="outline-text-5" id="text-0-0-0-1">
<p>
<i><span class="highlight">This chapter is under construction as the actual code is the priority.</span></i>
</p>
</div>
</div>

<div id="outline-container-org7b380bb" class="outline-2">
<h2 id="org7b380bb"><span class="section-number-2">1.</span> Export as documentation</h2>
<div class="outline-text-2" id="text-1">
<p>
Use org-publish-project to publish. Load tsbh-light theme first (load-theme).
</p>

<p>
Install <code>htmlize</code> package if published project isn't syntax-highlighted.
</p>

<p>
<code>touch * assets/*</code> in order to skip the cache.
</p>

<p>
<a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a>
</p>
</div>
</div>

<div id="outline-container-org719c5eb" class="outline-2">
<h2 id="org719c5eb"><span class="section-number-2">2.</span> Styles</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.todo.WIP </span>{ <span class="org-css-property">background</span>: <span class="custom-4">gold</span>; }

<span class="org-css-selector">html </span>{
  <span class="org-css-property">font-family</span>: sans-serif;
  <span class="org-css-property">line-height</span>: 1.25;
}

<span class="org-css-selector">.highlight </span>{ <span class="org-css-property">background</span>: <span class="custom-4">gold</span>; }

<span class="org-css-selector">body </span>{
  <span class="org-css-property">margin</span>: 3ex 1em;
}

<span class="org-css-selector">ul </span>{
  <span class="org-css-property">padding-left</span>: 1em;
}


<span class="org-css-selector">ul </span>{
  <span class="org-css-property">list-style</span>: none; <span class="org-comment-delimiter">/* </span><span class="org-comment">Remove default bullets</span><span class="org-comment-delimiter"> */</span>
}

<span class="org-css-selector">ul li::before </span>{
  <span class="org-css-property">content</span>: <span class="org-string">"\21FE"</span>;  <span class="org-comment-delimiter">/* </span><span class="org-comment">Add content: \2022 is the CSS Code/unicode for a bullet</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">TODO: checkmark</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">orgmode list add custom html class</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">https://emacs.stackexchange.com/questions/31803/custom-class-attribute-in-org-mode</span><span class="org-comment-delimiter"> */</span>
  <span class="org-comment-delimiter">/* </span><span class="org-comment">content: "\2714";  /\* Add content: \2022 is the CSS Code/unicode for a bullet *\/</span><span class="org-comment-delimiter"> */</span>
  <span class="org-css-property">color</span>: <span class="custom-3">darkgreen</span>; <span class="org-comment-delimiter">/* </span><span class="org-comment">Change the color</span><span class="org-comment-delimiter"> */</span>
  <span class="org-css-property">font-weight</span>: bold; <span class="org-comment-delimiter">/* </span><span class="org-comment">If you want it to be bold</span><span class="org-comment-delimiter"> */</span>
  <span class="org-css-property">display</span>: inline-block; <span class="org-comment-delimiter">/* </span><span class="org-comment">Needed to add space between the bullet and the text</span><span class="org-comment-delimiter"> */</span>
  <span class="org-css-property">width</span>: 1em; <span class="org-comment-delimiter">/* </span><span class="org-comment">Also needed for space (tweak if needed)</span><span class="org-comment-delimiter"> */</span>
  <span class="org-css-property">margin-left</span>: -0.5em; <span class="org-comment-delimiter">/* </span><span class="org-comment">Also needed for space (tweak if needed)</span><span class="org-comment-delimiter"> */</span>
  <span class="org-css-property">font-size</span>: 14pt;
}

<span class="org-comment-delimiter">/* </span><span class="org-comment">pre.src {</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">background: cornsilk;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">margin-left: 0;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>

<span class="org-css-selector">a:hover </span>{ <span class="org-css-property">text-decoration</span>: none; }
<span class="org-comment-delimiter">/* </span><span class="org-comment">a:visited, a:link { color: blue; }</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">a:hover { color: red; }</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">h1 {</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">color: brown;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">h2 {</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">color: #060d52;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">margin-bottom: 0;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">h3, h4, h5, h6 {</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">color: olivedrab;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">.todo {</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">color: white;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">border-radius: 5px;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">.todo, .done {</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">padding: 3px;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">color: white;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">border-radius: 5px;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">.todo { background: red; }</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">.done { background: green; }</span><span class="org-comment-delimiter"> */</span>

<span class="org-css-selector">blockquote </span>{
  <span class="org-css-property">background</span>: <span class="custom-2">aliceblue</span>;
  <span class="org-css-property">color</span>: <span class="custom-1">dimgrey</span>;
  <span class="org-css-property">font-style</span>: italic;
  <span class="org-css-property">border-left</span>: 10px solid <span class="custom">darkslategrey</span>;
  <span class="org-css-property">margin</span>: 1.5em 0;
  <span class="org-css-property">padding</span>: 0.5em 10px;
  <span class="org-css-property">padding-top</span>: 1em;
  <span class="org-css-property">quotes</span>: <span class="org-string">"\201C""\201D""\2018""\2019"</span>;
  <span class="org-css-property">border-radius</span>: 5px;
}

<span class="org-css-selector">blockquote:before </span>{
  <span class="org-css-property">color</span>: <span class="custom">darkslategrey</span>;
  <span class="org-css-property">font-style</span>: italic;
  <span class="org-css-property">content</span>: open-quote;
  <span class="org-css-property">font-size</span>: 4em;
  <span class="org-css-property">line-height</span>: 0.1em;
  <span class="org-css-property">margin-right</span>: 0.25em;
  <span class="org-css-property">vertical-align</span>: -0.4em;
}

<span class="org-css-selector">blockquote p </span>{
  <span class="org-css-property">margin</span>: 0; <span class="org-css-property">padding</span>: 0;
  <span class="org-css-property">padding-left</span>: 15px;
  <span class="org-css-property">padding-bottom</span>: 5px;
}

<span class="org-comment-delimiter">/* </span><span class="org-comment">@import url</span><span class="org-default">(</span><span class="org-comment">https://fonts.googleapis.com/css?family=Open+Sans:400italic</span><span class="org-default">)</span><span class="org-comment">;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">blockquote{</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">font-size: 1.4em;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">width:60%;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">margin:50px auto;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">font-family:Open Sans;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">font-style:italic;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">color: #555555;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">padding:1.2em 30px 1.2em 75px;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">border-left:8px solid #78C0A8 ;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">line-height:1.6;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">position: relative;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">background:#EDEDED;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">blockquote::before{</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">font-family:Arial;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">content: "\201C";</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">color:#78C0A8;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">font-size:4em;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">position: absolute;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">left: 10px;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">top:-10px;</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">/* </span><span class="org-comment">blockquote::after{</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/*   </span><span class="org-comment">content: '';</span><span class="org-comment-delimiter"> */</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">}</span><span class="org-comment-delimiter"> */</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">const</span> <span class="org-variable-name">$</span> = document.querySelector.bind(document)
<span class="org-keyword">const</span> <span class="org-variable-name">$$</span> = document.querySelectorAll.bind(document)

$$(<span class="org-string">"[class^='section-number-']"</span>).forEach((section) =&gt; {
  <span class="org-keyword">const</span> <span class="org-variable-name">linkTarget</span> = section.parentNode.id.match(<span class="org-string">/^org/</span>) ? section.innerText : section.parentNode.id
  section.innerHTML = <span class="org-string">`&lt;a href="#${linkTarget}"&gt;&#167;&lt;a name="${linkTarget}"&gt;&lt;/a&gt;&lt;/a&gt;`</span>
})
</pre>
</div>
</div>

<div id="outline-container-org4ea32b4" class="outline-5">
<h5 id="org4ea32b4"><span class="section-number-5">2.0.0.1.</span> <span class="todo TODO">TODO</span> This doesn't apply to non-associated buffers</h5>
<div class="outline-text-5" id="text-2-0-0-1">
<p>
Such as if you open a code block in a new buffer using <code>C-c '</code>, it doesn't respect the editorconfig settings.
</p>

<p>
Although currently even if I edit say the CSS above IN THE BUFFER, it still doesn't work. INVESTIGATE!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga94c49b"><span class="org-comment-delimiter">; </span><span class="org-comment">Run in shell: et export:install</span>

(package-initialize)

(add-to-list 'package-archives
             '(<span class="org-string">"melpa"</span> . <span class="org-string">"http://melpa.org/packages/"</span>))
(add-to-list 'package-archives
             '(<span class="org-string">"org"</span> . <span class="org-string">"http://orgmode.org/elpa/"</span>))

(package-refresh-contents)

(<span class="org-keyword">dolist</span> (pkg '(htmlize json-mode clojure-mode))
  (package-install pkg))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0e7d4d1" class="outline-2">
<h2 id="org0e7d4d1"><span class="section-number-2">3.</span> Publishing script</h2>
<div class="outline-text-2" id="text-3">
<p>
Better to run it as a script, so we can easier automate and there's theme switch required.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd66192b"><span class="org-comment-delimiter">; </span><span class="org-comment">Run in shell: et export:publish</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Set up load paths.</span>
(package-initialize)

(<span class="org-keyword">require</span> '<span class="org-constant">ox-publish</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">(defun mkprologue (buffer-name)</span>
<span class="org-comment-delimiter">;;   </span><span class="org-comment">(my/literate/mkprologue "https://jakub-stastny.github.io/rental-property-management/" buffer-name))</span>

(<span class="org-keyword">setq</span> org-publish-project-alist
      '(
        (<span class="org-string">"playground"</span> <span class="org-builtin">:components</span> (<span class="org-string">"playground.org"</span>))
        (<span class="org-string">"playground.org"</span>
         <span class="org-builtin">:base-directory</span> <span class="org-string">"."</span>
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"doc"</span>
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:exclude</span> <span class="org-string">"setupfile.org"</span>
         <span class="org-builtin">:recursive</span> f
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:org-html-doctype</span> <span class="org-string">"html5"</span>      <span class="org-comment-delimiter">; </span><span class="org-comment">check works</span>
         <span class="org-builtin">:headline-levels</span> 4
         <span class="org-builtin">:auto-preamble</span> f)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Set a theme that looks well when exported into HTML.</span>
(load-theme 'tsdh-light)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Publish.</span>
(<span class="org-keyword">setq</span> org-html-htmlize-output-type 'css)

(org-mode)
(org-publish-project <span class="org-string">"playground"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="org5dbfd13">rm -rf output/doc ~/.org-timestamps
./.env/bin/et.clj export:publish
</pre>
</div>
</div>
</div>
</div>
</body>
</html>